# CreateDataVisPDMenu

## Description
Creates a Layout Manager data visualization pull down menu control.

```pascal
PROCEDURE CreateDataVisPDMenu(
				dialogID               : LONGINT;
				componentID            : LONGINT;
				widthInStdChar         : INTEGER;
				showDefaultStaticItems : BOOLEAN);
```

```python

def vs.CreateDataVisPDMenu(dialogID, componentID, widthInStdChar, showDefaultStaticItems):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|dialogID|LONGINT||
|componentID|LONGINT||
|widthInStdChar|INTEGER|The width of the displayed text in standard character count. See GetDlgCtrlWidthStdCh.|
|showDefaultStaticItems|BOOLEAN||

## Version
Availability: from Vectorworks 2024
## Category
* Dialogs - Modern